# Reset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntriesLoadContent..::..Reset Method
KeyBasedTreeEntriesLoadContent Class See Also
---
Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void Reset()
```

Visual Basic
---
```text
Public Sub Reset
```

Visual C++
---
```text
public:
void Reset()
```

# Remarks
This method can be used to clear all data that has been added to this KeyBasedTreeEntriesLoadContent object to date so that the caller can start adding and building KeyBasedTreeEntries again.
# See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace